"""
5. Пользователь вводит номер буквы в алфавите. Определить, какая это буква.
"""

c = int(input('Enter the character number in the alphabet: '))
print(f'Symbol = {chr(c)}')
